test.txt
DBFactory: site.ycsb.db.CassandraGeomesaClient
Key=cassandra.contact.point   value=127.0.0.1:9042
Key=cassandra.catalog   value=ycsb
Key=cassandra.keyspace   value=ycsb
GEO_INTERSECT
java.lang.NullPointerException
	at java.io.StringReader.<init>(StringReader.java:50)
	at org.json.JSONTokener.<init>(JSONTokener.java:94)
	at org.json.JSONObject.<init>(JSONObject.java:406)
	at site.ycsb.generator.geo.ParameterGenerator.buildGeoReadPredicate(ParameterGenerator.java:288)
	at site.ycsb.GeoDBWrapper.geoIntersect(GeoDBWrapper.java:340)
	at site.ycsb.workloads.geo.GeoWorkload.doTransactionGeoIntersect(GeoWorkload.java:268)
	at site.ycsb.workloads.geo.GeoWorkload.doTransaction(GeoWorkload.java:200)
	at site.ycsb.ClientThread.run(ClientThread.java:122)
	at java.lang.Thread.run(Thread.java:748)
GEO_INTERSECT
java.lang.NullPointerException
	at java.io.StringReader.<init>(StringReader.java:50)
	at org.json.JSONTokener.<init>(JSONTokener.java:94)
	at org.json.JSONObject.<init>(JSONObject.java:406)
	at site.ycsb.generator.geo.ParameterGenerator.buildGeoReadPredicate(ParameterGenerator.java:288)
	at site.ycsb.GeoDBWrapper.geoIntersect(GeoDBWrapper.java:340)
	at site.ycsb.workloads.geo.GeoWorkload.doTransactionGeoIntersect(GeoWorkload.java:268)
	at site.ycsb.workloads.geo.GeoWorkload.doTransaction(GeoWorkload.java:200)
	at site.ycsb.ClientThread.run(ClientThread.java:122)
	at java.lang.Thread.run(Thread.java:748)
GEO_INTERSECT
java.lang.NullPointerException
	at java.io.StringReader.<init>(StringReader.java:50)
	at org.json.JSONTokener.<init>(JSONTokener.java:94)
	at org.json.JSONObject.<init>(JSONObject.java:406)
	at site.ycsb.generator.geo.ParameterGenerator.buildGeoReadPredicate(ParameterGenerator.java:288)
	at site.ycsb.GeoDBWrapper.geoIntersect(GeoDBWrapper.java:340)
	at site.ycsb.workloads.geo.GeoWorkload.doTransactionGeoIntersect(GeoWorkload.java:268)
	at site.ycsb.workloads.geo.GeoWorkload.doTransaction(GeoWorkload.java:200)
	at site.ycsb.ClientThread.run(ClientThread.java:122)
	at java.lang.Thread.run(Thread.java:748)
GEO_INTERSECT
java.lang.NullPointerException
	at java.io.StringReader.<init>(StringReader.java:50)
	at org.json.JSONTokener.<init>(JSONTokener.java:94)
	at org.json.JSONObject.<init>(JSONObject.java:406)
	at site.ycsb.generator.geo.ParameterGenerator.buildGeoReadPredicate(ParameterGenerator.java:288)
	at site.ycsb.GeoDBWrapper.geoIntersect(GeoDBWrapper.java:340)
	at site.ycsb.workloads.geo.GeoWorkload.doTransactionGeoIntersect(GeoWorkload.java:268)
	at site.ycsb.workloads.geo.GeoWorkload.doTransaction(GeoWorkload.java:200)
	at site.ycsb.ClientThread.run(ClientThread.java:122)
	at java.lang.Thread.run(Thread.java:748)
GEO_INTERSECT
java.lang.NullPointerException
	at java.io.StringReader.<init>(StringReader.java:50)
	at org.json.JSONTokener.<init>(JSONTokener.java:94)
	at org.json.JSONObject.<init>(JSONObject.java:406)
	at site.ycsb.generator.geo.ParameterGenerator.buildGeoReadPredicate(ParameterGenerator.java:288)
	at site.ycsb.GeoDBWrapper.geoIntersect(GeoDBWrapper.java:340)
	at site.ycsb.workloads.geo.GeoWorkload.doTransactionGeoIntersect(GeoWorkload.java:268)
	at site.ycsb.workloads.geo.GeoWorkload.doTransaction(GeoWorkload.java:200)
	at site.ycsb.ClientThread.run(ClientThread.java:122)
	at java.lang.Thread.run(Thread.java:748)
GEO_INTERSECT
java.lang.NullPointerException
	at java.io.StringReader.<init>(StringReader.java:50)
	at org.json.JSONTokener.<init>(JSONTokener.java:94)
	at org.json.JSONObject.<init>(JSONObject.java:406)
	at site.ycsb.generator.geo.ParameterGenerator.buildGeoReadPredicate(ParameterGenerator.java:288)
	at site.ycsb.GeoDBWrapper.geoIntersect(GeoDBWrapper.java:340)
	at site.ycsb.workloads.geo.GeoWorkload.doTransactionGeoIntersect(GeoWorkload.java:268)
	at site.ycsb.workloads.geo.GeoWorkload.doTransaction(GeoWorkload.java:200)
	at site.ycsb.ClientThread.run(ClientThread.java:122)
	at java.lang.Thread.run(Thread.java:748)
GEO_INTERSECT
java.lang.NullPointerException
	at java.io.StringReader.<init>(StringReader.java:50)
	at org.json.JSONTokener.<init>(JSONTokener.java:94)
	at org.json.JSONObject.<init>(JSONObject.java:406)
	at site.ycsb.generator.geo.ParameterGenerator.buildGeoReadPredicate(ParameterGenerator.java:288)
	at site.ycsb.GeoDBWrapper.geoIntersect(GeoDBWrapper.java:340)
	at site.ycsb.workloads.geo.GeoWorkload.doTransactionGeoIntersect(GeoWorkload.java:268)
	at site.ycsb.workloads.geo.GeoWorkload.doTransaction(GeoWorkload.java:200)
	at site.ycsb.ClientThread.run(ClientThread.java:122)
	at java.lang.Thread.run(Thread.java:748)
GEO_INTERSECT
java.lang.NullPointerException
	at java.io.StringReader.<init>(StringReader.java:50)
	at org.json.JSONTokener.<init>(JSONTokener.java:94)
	at org.json.JSONObject.<init>(JSONObject.java:406)
	at site.ycsb.generator.geo.ParameterGenerator.buildGeoReadPredicate(ParameterGenerator.java:288)
	at site.ycsb.GeoDBWrapper.geoIntersect(GeoDBWrapper.java:340)
	at site.ycsb.workloads.geo.GeoWorkload.doTransactionGeoIntersect(GeoWorkload.java:268)
	at site.ycsb.workloads.geo.GeoWorkload.doTransaction(GeoWorkload.java:200)
	at site.ycsb.ClientThread.run(ClientThread.java:122)
	at java.lang.Thread.run(Thread.java:748)
GEO_INTERSECT
java.lang.NullPointerException
	at java.io.StringReader.<init>(StringReader.java:50)
	at org.json.JSONTokener.<init>(JSONTokener.java:94)
	at org.json.JSONObject.<init>(JSONObject.java:406)
	at site.ycsb.generator.geo.ParameterGenerator.buildGeoReadPredicate(ParameterGenerator.java:288)
	at site.ycsb.GeoDBWrapper.geoIntersect(GeoDBWrapper.java:340)
	at site.ycsb.workloads.geo.GeoWorkload.doTransactionGeoIntersect(GeoWorkload.java:268)
	at site.ycsb.workloads.geo.GeoWorkload.doTransaction(GeoWorkload.java:200)
	at site.ycsb.ClientThread.run(ClientThread.java:122)
	at java.lang.Thread.run(Thread.java:748)
GEO_INTERSECT
java.lang.NullPointerException
	at java.io.StringReader.<init>(StringReader.java:50)
	at org.json.JSONTokener.<init>(JSONTokener.java:94)
	at org.json.JSONObject.<init>(JSONObject.java:406)
	at site.ycsb.generator.geo.ParameterGenerator.buildGeoReadPredicate(ParameterGenerator.java:288)
	at site.ycsb.GeoDBWrapper.geoIntersect(GeoDBWrapper.java:340)
	at site.ycsb.workloads.geo.GeoWorkload.doTransactionGeoIntersect(GeoWorkload.java:268)
	at site.ycsb.workloads.geo.GeoWorkload.doTransaction(GeoWorkload.java:200)
	at site.ycsb.ClientThread.run(ClientThread.java:122)
	at java.lang.Thread.run(Thread.java:748)
[OVERALL], RunTime(ms), 1749
[OVERALL], Throughput(ops/sec), 5.717552887364208
[TOTAL_GCS_PS_Scavenge], Count, 5
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 29
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 1.6580903373356204
[TOTAL_GCS_PS_MarkSweep], Count, 1
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 27
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 1.5437392795883362
[TOTAL_GCs], Count, 6
[TOTAL_GC_TIME], Time(ms), 56
[TOTAL_GC_TIME_%], Time(%), 3.201829616923957
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 16968.0
[CLEANUP], MinLatency(us), 16960
[CLEANUP], MaxLatency(us), 16975
[CLEANUP], 95thPercentileLatency(us), 16975
[CLEANUP], 99thPercentileLatency(us), 16975